Repository: roadkillwiki/roadkill
Catalog: src/Roadkill.Core/Localization/SiteStrings.*.resx
Languages: pt, ru

# SiteSettings_Cache_Key_Format
source: The keys are in the format:
pt: As chaves estão no formato:
ru: Клавиши в формате:

# SiteSettings_Cache_Key_Column_Header
source: Key
pt: Chave
ru: Ключ

# SiteSettings_Cache_Page_Cache
source: Page cache
pt: Cache de página
ru: Кэш Страница

# SiteSettings_Cache_List_Cache
source: Items cache
pt: Itens de cache
ru: Элементы кэш

# SiteSettings_Cache_Clear_Button
source: Clear cache
pt: Excluir cache
ru: Очистить кэш

# SiteSettings_Configuration_Unable_To_Save
source: Unable to save the settings:
pt: Não foi possível salvar as configurações:
ru: Невозможно сохранить настройки:

# SiteSettings_Configuration_Update_Successful
source: The settings were successfully updated.
pt: As configurações foram atualizadas com sucesso.
ru: Настройки были успешно обновлены.

# Recaptcha_Prompt
source: As an anti-spam measure, please enter the two words below
pt: Como uma medida anti-spam, por favor digite as duas palavras abaixo
ru: В качестве меры по борьбе со спамом, введите два слова ниже

# Button_Close
source: Close
pt: Fechar
ru: Близко

# SiteSettings_Cache_Site_Cache
source: Site cache
pt: Cache do site

# SiteSettings_Cache_Not_Enabled
source: The object cache is not currently enabled.
pt: O cache atualmente não está habilitado.
