Repository: roadkillwiki/roadkill
Catalog: src/Roadkill.Core/Localization/SiteStrings.*.resx
Languages: pt, ru

# Navigation_Login
source: Login
ru: Войти

# Navigation_Logout
source: Logout
pt: Sair
ru: Выход

# Navigation_Register
source: Register
pt: Registrar
ru: Регистрация

# Navigation_MainPage
source: Main Page
pt: Página Principal
ru: Главная страница

# Navigation_Categories
source: Categories
pt: Categorias
ru: Категории

# Navigation_AllPages
source: All pages
pt: Todas as páginas
ru: Все страницы

# Navigation_NewPage
source: New page
pt: Nova página
ru: Новая страница

# Navigation_SiteSettings
source: Site settings
pt: Configurações do site
ru: Настройки сайта

# Navigation_Edit
source: Edit
pt: Editar
ru: Редактировать

# Navigation_Delete
source: Delete
pt: Excluir
ru: Удалить

# Navigation_History
source: History
pt: Histórico
ru: История

# Navigation_ViewHistory
source: View History
pt: Ver Histórico
ru: Просмотреть историю

# Button_Login
source: Login
ru: Войти

# Button_Cancel
source: Cancel
pt: Cancelar
ru: Отменить

# Button_Save
source: Save
pt: Salvar
ru: Сохранить

# Button_Preview
source: Preview
pt: Visualização
ru: Предпросмотр

# Button_Import
source: Import
pt: Importar
ru: Импортировать

# Button_Rename
source: Rename
pt: Renomear
ru: Переименовать

# Button_Upload
source: Upload
ru: Загрузить

# Button_Search
source: Search
pt: Pesquisar
ru: Поиск

# Shared_EditLink
source: Edit
pt: Editar
ru: Редактировать

# Shared_DeleteLink
source: Delete
pt: Excluir
ru: Удалить

# Shared_ConfirmLink
source: Confirm
pt: Confirmar
ru: Подтвердить

# Shared_NotLoggedIn
source: Not logged in
pt: Você não está logado
ru: Вы не вошли

# Shared_LoggedInAs
source: Logged in as
pt: Logado como
ru: Вы вошли как

# Shared_LastModified
source: This page was last modified
pt: Esta página foi modificada pela última vez
ru: Последние изменения на странице в

# Shared_PoweredBy
source: Powered by Roadkill Wiki
pt: Desenvolvido por Roadkill Wiki
ru: Работает на Roadkill Wiki

# Shared_Firstname_Label
source: First name:
pt: Nome:
ru: Имя:

# Shared_Lastname_Label
source: Last name:
pt: Apelido:
ru: Фамилия:

# Shared_Username_Label
source: Username:
pt: Usuário:
ru: Имя пользователя:

# Shared_Password_Label
source: Password:
pt: Senha:
ru: Пароль:

# Shared_PasswordConfirm_Label
source: Password confirm:
pt: Confirmar senha:
ru: Подтверждение пароля:

# Shared_Error
source: An error occurred:
pt: Ocorreu um erro:
ru: Произошла ошибка:

# User_Validation_Username
source: The username field is required.
pt: O campo nome de usuário é necessário.
ru: Поле Имя пользователя является обязательным.

# User_Validation_Email
source: The email field is required.
pt: O campo e-mail é necessário.
ru: Поле E-mail является обязательным.

# User_Validation_Email_Check
source: The email field does not contain a valid email.
pt: O campo email não contém um e-mail válido.
ru: Поле E-mail не содержит действительный адрес электронной почты.

# User_Validation_UsernameExists
source: The username {0} already exists.
pt: O nome de usuário {0} já existe.
ru: Имя пользователя {0} уже существует.

# User_Validation_UsernameEmpty
source: The The username is empty.
pt: O nome de usuário está vazio.
ru: Имя пользователя пусто.

# User_Validation_EmailExists
source: The email {0} already exists.
pt: O e-mail {0} já existe.
ru: E-mail {0} уже существует.

# User_Validation_PasswordsDontMatch
source: The passwords don't match.
pt: As senhas não coincidem.
ru: Пароли не совпадают.

# User_Validation_PasswordTooShort
source: The password is less than {0} characters
pt: A senha é menor do que {0} caracteres
ru: Пароль меньше {0} символов

# Login_Title
source: Login
ru: Войти

# Login_ForgottenPassword
source: Forgotten your password?
pt: Esqueceu sua senha?
ru: Забыли пароль?

# Login_Unsuccessful_Title
source: Login was unsuccessful
pt: Não foi possível efetuar login
ru: Вход был неудачным

# Login_Error
source: The username/password is incorrect
pt: Nome de usuário/senha incorreto
ru: Имя пользователя или пароль неверны

# Signup_Title
source: Register / Signup
pt: Cadastro/Registrar
ru: Регистрация / регистрация

# Signup_Label
source: Please enter you details below.
pt: Por favor informe os detalhes abaixo.
ru: Пожалуйста, введите ваши данные ниже.

# Button_Signup
source: Register new user
pt: Criar novo usuário
ru: Регистрация нового пользователя

# Signup_Complete_Title
source: Signup complete.
pt: Registro completado.
ru: Регистрация завершена.

# Signup_Complete_Label
source: Thank you, an email has been sent to {0} with details on how to complete the signup.
pt: Obrigado, um email foi enviado para {0} com detalhes sobre como concluir a inscrição.
ru: Спасибо, письмо было отправлено на адрес {0} с подробной информацией о том, как завершить регистрацию.

# Signup_Complete_NoEmail
source: Not received your email?
pt: Não recebi seu e-mail?
ru: Не получили Ваш e-mail?

# Signup_Complete_EmailResent
source: The confirmation email was resent.
pt: O e-mail de confirmação foi reenviado.
ru: Подтверждение по электронной почте было перепосланно.

# Button_Signup_Complete_EmailResend
source: Resend email confirmation
pt: Reenviar e-mail de confirmação
ru: Отправить повторно письмо-подтверждение

# Signup_Error_General
source: An error occurred with the signup.
pt: Ocorreu um erro com o registro.
ru: Произошла ошибка в регистрации.

# Signup_Error_Recaptcha
source: The two words for the anti-spam box were incorrect
pt: As duas palavras para a caixa de anti-spam estão incorretos
ru: Эти два слова для анти-спам поля были неверными

# Activate_Title
source: Account Activation
pt: Ativação de Conta
ru: Активизация учетной записи

# Activate_Success_Title
source: Activation successful
pt: Ativação bem sucedida
ru: Активация прошла успешна

# Activate_Error_Title
source: Activation was unsuccessful
pt: Ativação não foi bem sucedida
ru: Активация не удалась

# Activate_Label
source: Your account has been sucessfully activated.
pt: Sua conta foi ativada com sucesso.
ru: Ваша учетная запись была успешно активирована.

# Activate_Link
source: Click here to login
pt: Clique aqui para acessar
ru: Нажмите сюда, чтобы войти

# Activate_Error
source: There was a problem activating your account. It may have already been activated.
pt: Houve um problema na ativação de sua conta. Ele já pode ter sido ativado.
ru: Проблема активации аккаунта. Возможно, аккаунт уже был активирован.

# ResetPassword_Title
source: Reset your password.
pt: Redefinir senha sucesso.
ru: Сбросить пароль.

# ResetPassword_Label
source: Enter your email below to reset your password. You will then receive an email with a link to reset your password.
pt: Digite seu email abaixo para redefinir sua senha. Você receberá um e-mail com um link para redefinir sua senha.
ru: Введите адрес электронной почты ниже, чтобы сбросить пароль. После этого вы получите письмо с ссылкой для восстановления пароля.

# ResetPassword_Complete_Label
source: Please enter your new password.
pt: Por favor insira sua nova senha.
ru: Пожалуйста, введите новый пароль.

# Button_ResetPassword
source: Reset password
pt: Redefinir senha
ru: Сброс пароля

# ResetPassword_Successful_Title
source: Reset password successful.
pt: Redefinir a senha de sucesso.
ru: Пароль успешно сброшен.

# ResetPassword_Successful_Label
source: Your password was sucessfully reset.
pt: Sua senha foi redefinida com sucesso.
ru: Ваш пароль был успешно сбросить.

# ResetPassword_Invalid_Title
source: Reset password invalid.
pt: Redefinir senha inválida.
ru: Сброшенный пароль недействительный.

# ResetPassword_Invalid_Label
source: The password reset key is no longer valid.
pt: A chave de redefinição de senha não é mais válida.
ru: Ключ сброса пароля устарел.

# ResetPassword_EmailSent_Title
source: Your password reset request was sent.
pt: Sua solicitação de redefinição de senha foi enviada.
ru: Запрос на сброса пароля был отправлен.

# ResetPassword_EmailSent_Label
source: Thank you, an email has been sent to {0} with details on how to reset your password.
pt: Obrigado, um email foi enviado para {0} com detalhes sobre como redefinir sua senha.
ru: Спасибо, письмо было отправлено на адрес {0} с подробной информацией о том, как изменить пароль.

# ResetPassword_Error
source: The passwords do not match, or are too short
pt: As senhas não são iguais, ou são muito curtos
ru: Пароли не совпадают, или слишком короткие

# ResetPassword_Error_ServerError
source: The password reset failed from a server error.
pt: A redefinição de senha falhou devido a um erro no servidor.
ru: Сброса пароля не удалось с сервера ошибку.

# ResetPassword_Error_EmailNotFound
source: The email address could not be found
pt: O endereço de e-mail não pôde ser encontrado
ru: Адрес электронной почты не найден

# ResetPassword_Error_MissingEmail
source: Please enter an email address
pt: Por favor insira um endereço de e-mail
ru: Пожалуйста, введите адрес электронной почты

# Profile_Title
source: Profile
pt: Perfil
ru: Профиль

# Profile_Error
source: An error occurred updating your profile
pt: Ocorreu um erro ao atualizar o seu perfil
ru: Произошла ошибка обновление профиля

# NoMainPage_Title
source: You have no mainpage set
pt: Você não definiu uma página principal
ru: У вас не создана Главная Страница

# NoMainPage_Label
source: To set a main page, create a page and assign the tag 'homepage' to it.
pt: Para definir uma página princiapl, crie uma página e atribua a tag 'homepage'.
ru: Чтобы настроить главную страницу, создайте страницу и присвоить ей тэг 'homepage'.

# Search_PlaceHolder
source: Enter text to search
pt: Digite o texto a ser pesquisado
ru: Введите текст для поиска

# Search_Results
source: Search results for '{0}'
pt: Resultados da busca por '{0}'
ru: Результаты поиска для '{0}'

# Search_NoResults
source: Your search '{0}' did not match any pages
pt: Sua busca por '{0}' não encontrou nenhuma página
ru: Ваш поиск '{0}' не соответствует ни одной странице

# AllPages_Title
source: All Pages
pt: Todas as páginas
ru: Все страницы

# AllPages_NoPages
source: No pages found.
pt: Nenhum resultado foi encontrado.
ru: Страницы не найдены.

# AllTags_Title
source: All Tags
pt: Todas as Tags
ru: Все Теги

# AllTags_NoResults
source: No tags found.
pt: Nenhuma tag encontrada.
ru: Тегов не найдено.

# AllPages_TitleColumnHeading
source: Title
pt: Título
ru: Название

# Pages_ForUser
source: All pages created by {0}
pt: Todas as páginas criadas por {0}
ru: Все страницы, созданные {0}

# Pages_ForUser_NoPages
source: {0} hasn't created any pages yet.
pt: {0} não criou nenhuma página ainda.
ru: {0} еще не имеет созданных страниц.

# Pages_ForTag
source: All pages for tag {0}
pt: Todas as páginas da tag {0}
ru: Все страницы для тега {0}

# Pages_ForTag_NoPages
source: No pages for {0}
pt: Não há páginas para {0}
ru: Нет страниц для {0}

# History_Title
source: Page history
pt: Histórico da página
ru: История страницы

# History_Version
source: Version
pt: Versão
ru: Версия

# History_EditedOn
source: Edited on
pt: Editado em
ru: Отредактировано в

# History_EditedBy
source: Edited by
pt: Editado por
ru: Редактировал

# History_RevertLink
source: Revert
pt: Reverter
ru: Вернуть к состоянию

# Version_Title
source: Version {0}
pt: Versão {0}
ru: Версия {0}

# Version_BackLink
source: back
pt: Voltar
ru: назад

# Page_Info_CreatedOn
source: Created on:
pt: Criado em:
ru: Создано:

# Page_Info_CreatedBy
source: Created by:
pt: Criado por:
ru: Создано:

# Page_Info_ModifiedOn
source: Last modified on:
pt: Última modificação em:
ru: Последнее изменение:

# Page_Info_ModifiedBy
source: Last modified by:
pt: Última modificação por:
ru: Последнее изменение:

# Page_Validation_Title
source: The title field is required.
pt: O campo de título é obrigatório.
ru: Поле Название является обязательным.

# EditPage_Title
source: Add/edit page
pt: Adicionar/Editar página
ru: Добавить/редактировать страницу

# EditPage_Title_Label
source: Title
pt: Título
ru: Название

# EditPage_Tags_Label
source: Tags
ru: Тэги

# EditPage_AdminOnly
source: This page can only be edited by administrators.
pt: Esta página só pode ser editada por administradores.
ru: Эта страница может быть отредактирована толька администраторами.

# EditPage_Preview
source: Preview
pt: Visualização
ru: Предпросмотр

# EditPage_LinkUrl_PlaceHolder
source: enter url or page name
pt: inserir url ou nome da página
ru: введите адрес или имя страницы

# EditPage_LinkText_PlaceHolder
source: Link text
pt: O texto do link
ru: Текст ссылки

# EditPage_Image_Title
source: Image title
pt: Título da Imagem
ru: Название изображения

# EditPage_Error
source: Unable to save the page:
pt: Não foi possível salvar a página:
ru: Невозможно сохранить страницу:

# EditPage_Toolbar_Bold
source: Bold
pt: Texto em negrito.
ru: Жирный шрифт

# EditPage_Toolbar_BulletList
source: Bullet list
pt: Inserir marcadores
ru: Список

# EditPage_Toolbar_Heading2
source: Heading 2
pt: Inserir cabeçalho 2.
ru: Заголовок 2 уровня

# EditPage_Toolbar_Heading3
source: Heading 3
pt: Inserir cabeçalho 3.
ru: Заголовок 3 уровня

# EditPage_Toolbar_Heading4
source: Heading 4
pt: Inserir cabeçalho 4.
ru: Заголовок 4 уровня.

# EditPage_Toolbar_Heading5
source: Heading 5
pt: Inserir cabeçalho 5.
ru: Заголовок 5 уровня.

# EditPage_Toolbar_Help
source: View Help reference.
pt: Ver ajuda de referência para a sintaxe de marcação.
ru: Справка синтаксис разметки.

# EditPage_Toolbar_Image
source: Image
pt: Inserir imagem.
ru: Вставить изображение

# EditPage_Toolbar_Italic
source: Italic
pt: Texto em itálico.
ru: Курсив

# EditPage_Toolbar_Link
source: Link
pt: Inserir endereço de web (URL).
ru: URL Ссылка

# EditPage_Toolbar_NumberList
source: Numbered list
pt: Inserir Numeração.
ru: Нумерованный список

# EditPage_Toolbar_Underline
source: Underline
pt: Texto sublinhado.
ru: Подчеркивание

# SiteSettings_Configuration
source: Configuration
pt: Configuração
ru: Конфигурация

# SiteSettings_UserManagement
source: Users
pt: Usuários
ru: Пользователи

# SiteSettings_Tools
source: Tools
pt: Ferramentas
ru: Инструменты

# SiteSettings_Configuration_Title
source: Site Settings
pt: Definições do Site
ru: Параметры сайта

# SiteSettings_Configuration_Site
source: Site
pt: Local
ru: Сайт

# SiteSettings_Configuration_SiteName
source: Site name
pt: Nome do site
ru: Название сайта

# SiteSettings_Configuration_SiteUrl
source: Site url
pt: URL do site
ru: URL сайта

# SiteSettings_Configuration_Database
source: Database
pt: Banco de dados
ru: База данных

# SiteSettings_Configuration_DatabaseType
source: Database type
pt: Tipo de banco de dados
ru: Тип базы данных

# SiteSettings_Configuration_DatabaseConnectionString
source: Connection string
pt: String de conexão do banco de dados
ru: Строка подключения к базе данных

# SiteSettings_Configuration_Security
source: Security
pt: Segurança
ru: Безопасность

# SiteSettings_Configuration_UseWindowsAuth
source: Use Windows Authentication
pt: Usar Autenticação do Windows
ru: Использовать проверку подлинности Windows

# SiteSettings_Configuration_AllowUserSignups
source: Allow user signups
pt: Permitir cadastro de usuários
ru: Разрешить регистрацию пользователей

# SiteSettings_Configuration_EnableRecaptcha
source: Enable recaptcha
pt: Ativar recaptcha
ru: Включить ReCaptcha

# SiteSettings_Configuration_RecaptchaPrivateKey
source: Recaptcha private key
pt: Código chave privada
ru: Recaptcha закрытый ключ

# SiteSettings_Configuration_RecaptchaPublicKey
source: Recaptcha public key
pt: Código de chave pública
ru: Recaptcha открытый ключ

# SiteSettings_Configuration_AD_Connection
source: Authentication/LDAP connection string
pt: Autenticação/string de conexão LDAP
ru: Идентификация/LDAP строка подключения

# SiteSettings_Configuration_AD_Username
source: LDAP username
pt: Nome de usuário LDAP
ru: LDAP имя пользователя

# SiteSettings_Configuration_AD_Password
source: LDAP password
pt: Senha LDAP
ru: LDAP пароль

# SiteSettings_Configuration_EditorRole
source: Editor role/security group name
pt: Função de Editor/nome do grupo de segurança
ru: Роль редактора/имя группы безопасности

# SiteSettings_Configuration_AdminRole
source: Admin role/security group name
pt: Função de Admin/nome do grupo de segurança
ru: Админ роль/имя группы безопасности

# SiteSettings_Configuration_General
source: General
pt: Geral
ru: Общее

# SiteSettings_Configuration_MarkupType
source: Markup type
pt: Tipo de markup
ru: Тип разметки

# SiteSettings_Configuration_Theme
source: Theme
pt: Tema
ru: Тема

# SiteSettings_Configuration_Attachments
source: Attachments folder
pt: Pasta de Anexos
ru: Папка вложений

# SiteSettings_Configuration_Extensions
source: Allowed extensions
pt: Extensões permitidas
ru: Допустимые расширения

# SiteSettings_Configuration_CachingTitle
source: Caching
ru: Кэширование

# SiteSettings_Configuration_ObjectCaching
source: Object caching
pt: Cache de objetos
ru: Кэширование объектов

# SiteSettings_Configuration_BrowserCaching
source: Browser caching
pt: O cache do navegador
ru: Кэширование на стороне браузера

# SiteSettings_Configuration_Error
source: Unable to save the settings
pt: Não foi possível salvar as configurações
ru: Не удалось сохранить настройки

# SiteSettings_Configuration_CachePageText
source: (This key is no longer used. To be removed in 2.0)
pt: (Esta chave não é mais usado. Para ser removido na versão 2.0)
ru: (Этот ключ больше не используется. Сниматься в 2.0)

# SiteSettings_Configuration_SiteName_Help
source: The name of the site, which appears on certain themes and in signup emails (if enabled).
pt: O nome do site, que aparece em certos temas e nos emails de boas vindas (se habilitado).
ru: Имя сайта, который используется в некоторых темах.

# SiteSettings_Configuration_SiteUrl_Help
source: The url of the site, which is used in signup and reset password emails. Do not include the trailing slash.
pt: Url do site, que é utilizado para logar e resetar senha por email. Não inclua a barra.
ru: Адрес сайта, который используется в сообщениях электронной почты при регистрации и сброса пароля. Не добавляйте завершающий слэш.

# SiteSettings_Configuration_ConnectionStrings_Help
source: Changes your connection string. Note: Roadkill won't automatically recreate the database structure.
pt: Altera o tipo de banco de dados - você vai precisar recriar o esquema nas ferramentas para que isso funcione corretamente.
ru: Изменить стоку подключения - вам нужно будет пересоздать схему в разделе Инструменты для корректной работы.

# SiteSettings_Configuration_DatabaseType_Help
source: Changes the database type you're using. Note: Roadkill won't automatically recreate the database structure
pt: Altera o tipo de banco de dados - você vai precisar recriar o esquema nas ferramentas para que isso funcione corretamente.
ru: Изменить тип базы данных - вам нужно будет пересоздать схему в разделе Инструменты для корректной работы.

# SiteSettings_Configuration_DatabaseConnectionString_Help
source: The database connection string.
pt: Connection string
ru: Строка подключения к базе данных.

# SiteSettings_Configuration_UseWindowsAuth_Help
source: {bold}WARNING{/bold} changing this may lock you out of the site. Make a backup of your web.config first before saving.{br}{br} Sets whether to use Windows Authentication and Active Directory for authentication.
pt: {bold}AVISO{/bold} alterando esta configuração pode bloqueá-lo por completo do site. Primeiramente faça um backup do seu web.config antes de salvar. {br}Define que irá utilizar autenticação do windows e Active Directory para autenticação.
ru: {bold}ВНИМАНИЕ{/bold} При изменениях этого вас может заблокировать на сайте. Сделайте резервную копию вашего web.config перед сохранением. {br}{br} Включение и отключение использования проверки подлинности Windows и Active Directory для аутентификации.

# SiteSettings_Configuration_AllowUserSignups_Help
source: Check this option if you want to allow people to signup as a new users. If left unchecked, only admins will be able to create new users.
pt: Marque esta opção se você permie que as pessoas se cadastrem como novos usuários. Deixando desmarcado apenas os adminsitradores poderão cadastrar novoso usuários.
ru: Отметьте эту опцию, если вы хотите разрешить людям зарегистрироваться в качестве нового пользователя.

# SiteSettings_Configuration_EnableRecaptcha_Help
source: Enable Recaptcha support - a free anti-spam bot service. You will need to signup and copy your public and private key into the fields below.
pt: Ativa suporte a Recaptacha - um anti-spam contra bots. Você precisa se registrar e copiar a sua chace pública e privada nos campos abaixo.
ru: Включить поддержка Recaptcha - бесплатный анти-спам бот сервис . Вам нужно, чтобы зарегистрироваться и скопировать открытый и закрытый ключ в поле ниже.

# SiteSettings_Configuration_RecaptchaPrivateKey_Help
source: The private key for Recaptcha, which is provided when you signup with recaptcha.
pt: A chave privada para o Recaptcha, que é fornecida quando você se inscreve com recaptcha.
ru: Закрытый ключ Recaptcha, который предоставляется после регистрации в ReCaptcha.

# SiteSettings_Configuration_RecaptchaPublicKey_Help
source: The public key for Recaptcha, which is provided when you signup with recaptcha.
pt: A chave pública para o Recaptcha, que é fornecida quando você se inscreve com recaptcha.
ru: Открытый ключ Recaptcha, который предоставляется после регистрации в ReCaptcha.

# SiteSettings_Configuration_AD_Connection_Help
source: The LDAP connection string for the Active Directory connection.This should be in the format LDAP://mydc01.company.internal (it should be uppercase LDAP).
pt: LDAP connection string para o Active Directory. Deve estar no formato LDAP://mydc01.empresa.interno (LDAP deve ser maiúscul).
ru: LDAP строка соединения для Active Direction соединения.Должна быть в формате LDAP://mydc01.company.internal (LDAP - должен быть в верхнем регистре )

# SiteSettings_Configuration_AD_Username_Help
source: The username to authenticate against the Active Directory with. Leave blank if the app pool is running under a user with this permission.
pt: O nome de usuário para autenticar no Active Directory com. Deixe em branco se o pool de aplicativo está sendo executado sob um usuário com essa permissão.
ru: Имя пользователя для аутентификации с Active Directory. Оставьте пустым, если пул приложение работает под учетной записью пользователя с таким разрешением.

# SiteSettings_Configuration_AD_Password_Help
source: The password to use for authentication.
pt: A senha usada para autenticação.
ru: Пароль, используемый для аутентификации.

# SiteSettings_Configuration_EditorRole_Help
source: This is the name of the editor role - people who can edit and create pages. This is only used for Active Directory/Windows authentication - leave this blank to allow all users to be editors.
pt: Este é o nome da função de editor - pessoas que podem editar e criar páginas. Isto é usado apenas para Active Directory/autenticação Windows - deixar em branco para permitir que todos os usuários sejam editores.
ru: Это имя роли редактора - люди, которые могут редактировать и создавать страницы. Это используется только для Active Directory / Windows аутентификации - оставить это поле пустым, чтобы позволить всем пользователям быть редакторами.
