Repository: roadkillwiki/roadkill
Catalog: src/Roadkill.Core/Localization/SiteStrings.*.resx
Languages: pt, ru

# SiteSettings_Configuration_AdminRole_Help
source: {bold}WARNING{/bold} changing this may lock you out of the site when using Active Directory/Windows authentication. Make a backup of your web.config first before saving. {br}{br}This is the name of the admin role. Admins have the same rights as editors, but also have access to configuration settings and tools for the site.
pt: {bold}AVISO{/bold} alterando esta configuração pode bloqueá-lo por completo quando estiver utilizando Active Directory/autenticação do Windows. Primeiramente faça um backup do seu web.config antes de salvar. {br} Este é o nome da função de administrador. Administradores têm os mesmos direitos que os editores, mas também tem acesso a configurações e ferramentas do site.
ru: {bold}ВНИМАНИЕ{/bold} При изменениях этого вас может заблокировать на сайте. Сделайте резервную копию вашего web.config перед сохранением. {br}{br} Это имя роли администратора. Администраторы имеют те же права, редакторов, но и иметь доступ к настройкам конфигурации и инструментам сайта.

# SiteSettings_Configuration_MarkupType_Help
source: This is the markup format that is used. Roadkill currently supports the following values: Creole, Markdown, Mediawiki.
pt: Este é o formato de marcação que esta sendo utilizado. O Roadkill atualmente suporta os seguintes valores: Creole, Markdown, Mediawiki.
ru: Это формат разметки, который используется. Roadkill в настоящее время поддерживает следующие значения: Creole, Markdown, MediaWiki.

# SiteSettings_Configuration_Theme_Help
source: This is the theme that the site uses. This should match a folder name in the Themes directory.
pt: Este é o tema que o site atualmente utiliza. Isso deve corresponder a um nome de pasta no diretório Themes.
ru: Тема используемая сайтом. Она должена совпадать с именем папки в каталоге Themes.

# SiteSettings_Configuration_Attachments_Help
source: This is the directory where all files are uploaded to. This setting should start with ~/ to indicate the site root folder.
pt: Este é o diretório onde todos os arquivos serão enviados. Esta configuração deve começar com ~/ para indicar a pasta raiz do site.
ru: Это каталог, в который загружаются все файлы. Путь должен начинаться с ~/, чтобы указать на корень сайта.

# SiteSettings_Configuration_Extensions_Help
source: These are the file extensions that can be uploaded, comma separated.
pt: Estas são as extensões de arquivos que podem ser enviados, separados por vírgulas.
ru: Это расширения файлов, с которыми могут быть загружены файлы. Через запятую.

# SiteSettings_Configuration_ObjectCaching_Help
source: Enables Object caching. Roadkill caches all pages and content in memory after retrieving it from the database. The cache is automatically updated when a page changes. Recommended to increase the responsiveness of the site. Object caching is not currently supported for web gardens or web farms.
pt: Permite o armazenamento em cache de objetos. O Roadkill armazena todas as páginas e conteúdos na memória após recuperá-los do banco de dados. O cache é atualizado automaticamente quando uma página é modificada. Recomendado para aumentar a capacidade de resposta do site. O Cache de objetos não é suportado para web gardens ou web farms.
ru: Включает кэширование объектов. Roadkill кэширует все страницы и контент в памяти после извлечения его из базы данных. Кэш автоматически обновляется при изменении страницы. Рекомендуется повышение способности сайта. Кэширование объектов в настоящее время не поддерживается для веб-сады или веб-ферм.

# SiteSettings_Configuration_BrowserCaching_Help
source: Enables caching on the browser. This will tell the browser to cache Roadkill pages, and check for updates (If-Modified-Since) each time the page is loaded. If no update is found, no content is returned from the server. Recommended to increase the responsiveness of the site.
pt: Permite o armazenamento em cache no navegador. Isto irá dizer ao navegador para armazenar em cache as páginas do Roadkill, e verificar se há atualizações a cada vez que a página for carregada. Se nenhuma atualização for encontrada, nenhum conteúdo será retornado do servidor. Recomendado para aumentar a capacidade de resposta do site.
ru: Roadkill кэширует все страницы и контент в памяти после извлечения его из базы данных. Кэш автоматически обновляется при изменении страницы. Рекомендуется для повышения производительности сайта. Кэширование объектов в настоящее время не поддерживается для веб-садов или веб-ферм.

# SiteSettings_Configuration_Caching_Help
source: (This key is no longer used. To be removed in 2.0)
pt: (Esta chave não é mais usado. Para ser removido na versão 2.0)
ru: (Этот ключ больше не используется. Сниматься в 2.0)

# SiteSettings_Configuration_CachePageText_Help
source: (This key is no longer used. To be removed in 2.0)
pt: (Esta chave não é mais usado. Para ser removido na versão 2.0)
ru: (Этот ключ больше не используется. Сниматься в 2.0)

# SiteSettings_UserManagement_Title
source: Site users
pt: Usuários do site
ru: Пользователи сайта

# SiteSettings_UserManagement_ColumnHeader_Username
source: Username
pt: Usuário
ru: Имя пользователя

# SiteSettings_UserManagement_Admins
source: Admins
pt: Administradores
ru: Администраторы

# SiteSettings_UserManagement_NewAdmin
source: New admin user
pt: Novo usuário administrador
ru: Новый администратор

# SiteSettings_UserManagement_Editors
source: Editors
pt: Editores
ru: Редакторы

# SiteSettings_UserManagement_NewEditor
source: New editor user
pt: Novo usuário editor
ru: Новый пользователь редактор

# SiteSettings_UserManagement_AddAdmin_Title
source: Add admin
pt: Adicionar administrador
ru: Добавить администратора

# SiteSettings_UserManagement_AddEditor_Title
source: Add editor
pt: Adicionar editor
ru: Добавить редактора

# SiteSettings_UserManagement_EditUser_Title
source: Edit user
pt: Editar usuário
ru: Редактировать пользователя

# SiteSettings_UserManagement_AddUser_Help
source: For existing users, leave the password fields blank to change just the username.
pt: Para os usuários existentes, deixar os campos de senha em branco para mudar apenas o nome de usuário.
ru: Для существующих пользователей, оставьте поле пароля пустым, чтобы изменить только имя пользователя.

# SiteSettings_UserManagement_AddUser_Error
source: Unable to save the user details:
pt: Não foi possível salvar os detalhes do usuário:
ru: Не удалось сохранить данные пользователя:

# SiteSettings_UserManagement_EditUser_Error
source: Updating the user failed.
pt: Falha ao atualizar as informações do usuário.
ru: Обновление пользователя не удалось.

# SiteSettings_UserManagement_AD_Title
source: Windows/Active Directory authentication is enabled
pt: Autenticação/Active Directory do Windows está habilitado
ru: Windows/Active Directory проверка подлинности включена

# SiteSettings_UserManagement_AD_Label1
source: User names and passwords are not editable with Windows authentication - you should do this through Active Directory.
pt: Os nomes de usuário e senhas não são editáveis ​​com a autenticação do Windows - você deve fazer isso por meio do Active Directory.
ru: Имена пользователей и пароли не редактируются в режиме проверки подлинности Windows - вы должны сделать это через Active Directory.

# SiteSettings_UserManagement_AD_Label2
source: To add a user as an admin or editor, make sure they are part of the Windows security group that you have specified for the "AdminRolename" and "EditorRolename" settings in the web.config.
pt: Para adicionar um usuário como administrador ou editor, certifique-se que eles fazem parte do grupo de segurança do Windows que você especificou para a "AdminRolename" e as configurações de "EditorRolename" no web.config.
ru: Чтобы добавить пользователя в качестве администратора или редактора, убедитесь, что они являются частью группы безопасности Windows, который вы указали для "AdminRolename" и "EditorRolename" настройки в web.config.

# SiteSettings_Tools_Title
source: Site tools
pt: Ferramentas do Site
ru: Средства управления сайтом

# SiteSettings_Tools_ClearDatabase
source: Clear the database
pt: Limpar o banco de dados
ru: Очистить базу данных

# SiteSettings_Tools_ClearDatabase_Label
source: Clears all pages and text from the database. This does not remove any users.
pt: Limpa todas as páginas e textos do banco de dados. Isso não remove todos os usuários.
ru: Удаляет все страницы и текст из базы данных. Это не приводит к удалению пользователей.

# SiteSettings_Tools_ClearDatabase_Message
source: Database cleared
pt: Banco de dados limpo
ru: База данных очищена

# SiteSettings_Tools_RebuildSearch
source: Rebuild search index
pt: Reconstruir índice de pesquisa
ru: Перестроить индекс поиска

# SiteSettings_Tools_RebuildSearch_Label
source: Forces a re-build of the page search index, useful if the search begins to get out of sync for any reason.
pt: Força uma reconstrução do índice de busca da página, útil se a busca começar a ficar lenta.
ru: Вызывает перестройку индекса страниц поиска, полезно, если начинается рассинхронизация поиска по какой-то причине.

# SiteSettings_Tools_RebuildSearch_Message
source: Rebuild of search index complete
pt: Reconstruição do índice de busca completo
ru: Перестроение поискового индекса завершено

# SiteSettings_Tools_ExportXml
source: Export to XML
pt: Exportar para XML
ru: Экспорт в XML

# SiteSettings_Tools_ExportXml_Label
source: Exports all page text content and all history as a single XML file.
pt: Exporta todo o conteúdo das páginas e seu histórico em um único arquivo XML.
ru: Экспортирует все содержание страницы текста, и все истории, как единый XML файла.

# SiteSettings_Tools_ExportXml_Error
source: Exporting to XML failed: {0}
pt: Exportação para XML falhou: {0}
ru: Экспорт в XML не удался: {0}

# SiteSettings_Tools_ExportContent
source: Export all content as a zip
pt: Exporta todo o conteúdo como um zip
ru: Экспортировать все содержимое в виде ZIP

# SiteSettings_Tools_ExportContent_Label
source: Exports all pages, including text content as a series of ".wiki" files. Only the current content and tags are included, no history is provided. This zip file does not include the attachments folder.
pt: Exporta todas as páginas, os textos serão salvos no formato "".Wiki". Somente o conteúdo atual e as tags serão incluídos, nenhum histórico será exportado. O arquivo zip não inclui a pasta de anexo.
ru: Экспорт всех страниц, в том числе текстовые содержания серии ". Вики" файлов. Только текущее содержание и теги, ни одна история не предоставляется. Этот почтовый файл не включает вложения папки.

# SiteSettings_Tools_ExportContent_Error
source: Wiki content export failed: {0}
pt: A exportação do conteúdo falhou: {0}
ru: Wiki содержание экспорта не удалось: {0}

# SiteSettings_Tools_ExportAttachments
source: Export attachments as a zip
pt: Exportar anexos como um zip
ru: Экспорт вложениий в виде ZIP

# SiteSettings_Tools_ExportAttachments_Label
source: Exports all the contents of attachments folder and subfolders as a zip file.
pt: Exporta todo o conteúdo da pasta e subpastas de anexos como um zip.
ru: Экспортирует все содержимое папки и вложенные папки вложений в виде архива.

# SiteSettings_Tools_ExportAttachments_Error
source: Exporting attachments failed: {0}
pt: A exportação dos anexos falhou: {0}
ru: Экспорт вложений не удался: {0}

# SiteSettings_Tools_ScrewTurnImport
source: Import from screwturn
pt: Importar de ScrewTurn
ru: Импорт из ScrewTurn

# SiteSettings_Tools_ScrewTurnImport_Label
source: Imports all content from a Screwturn 2/3 database. You will need to set the markuptype to MediaWiki in the settings/web.config file for the format to be compatible. As screwturn uses as variation on the mediawiki syntax, some content will not render perfectly. This includes some images and links.
pt: Importações todo o conteúdo de um banco de dados ScrewTurn 2. Você precisará definir o markuptype para MediaWiki nas configurações / arquivo Web.config para o formato a ser compatível. Como ScrewTurn usa como variação da sintaxe MediaWiki, alguns conteúdos não tornará perfeitamente. Isto inclui algumas imagens e links.
ru: Импортирует все содержимое ScrewTurn 2 базы данных. Вам нужно будет установить на MediaWiki markuptype в settings/web.config для совместимости форматов. Так как ScrewTurn использует в качестве синтаксиса вариацию MediaWiki, некоторые содержимое не будет отображаться идеально. Это включает в себя некоторые изображения и ссылки.

# SiteSettings_Tools_ScrewTurnImport_Connection
source: Screwturn connection string:
pt: ScrewTurn string de conexão:
ru: ScrewTurn строка соединения:

# SiteSettings_Tools_ScrewTurnImport_Message
source: Import successful
pt: Importação bem sucedida
ru: Импорт прошел успешно

# SiteSettings_Tools_RenameTag
source: Rename a tag
pt: Renomear uma tag
ru: Переименовать тэг

# SiteSettings_Tools_RenameTag_Label
source: This will rename a tag, and update all pages that reference the tag to use the new tagname. The tagname is case sensitive.
pt: Isto irá renomear uma tag e atualizar todas as páginas que fazem referência a ela a fim de usar o novo tag. O tag é case sensitive.
ru: Это переименует тэг, и обновить все страницы, которые ссылаются на данный тэг. Тэг чувствителен к регистру.

# SiteSettings_Tools_RenameTag_Existing
source: Existing tag:
pt: Tag existente:
ru: Существующий тег:

# SiteSettings_Tools_RenameTag_New
source: New tag name:
pt: Novo nome da tag:
ru: Новое имя тега:

# SiteSettings_Tools_RenameTag_Message
source: Tag rename successful
pt: Tag renomeada com sucesso
ru: Тэг успешно переименован

# SiteSettings_Validation_AttachmentsEmpty
source: The attachments folder is empty.
pt: A pasta de anexos está vazia.
ru: Папка вложений пуста.

# SiteSettings_Validation_AttachmentsReservedName
source: '~/Files' is a reserved path, please choose another attachments folder.
pt: '~/Files " é uma pasta reservada, por favor escolha outro nome para a pasta de anexos.
ru: '~/Files' зарезервированный путь, пожалуйста, выберите другую папку вложений.

# SiteSettings_Validation_ConnectionEmpty
source: The connection string is empty.
pt: A connection string está vazia.
ru: Строка подключения пуста.

# SiteSettings_Validation_MarkupTypeEmpty
source: The markup type is empty.
pt: O tipo de marcação está vazio.
ru: Тип разметки пуст.

# SiteSettings_Validation_ThemeEmpty
source: The theme is empty.
pt: O tema está vazio.
ru: Тема пуста.

# SiteSettings_Validation_SiteNameEmpty
source: The sitename is empty.
pt: O nome do site está vazio.
ru: Имя сайта пусто.

# SiteSettings_Validation_SiteUrlEmpty
source: The site url is empty.
pt: A url do site está vazio.
ru: Адрес сайта пуст.

# FileManager_Title
source: Manage files
pt: Gerenciar arquivos
ru: Управление файлами

# FileManager_Upload
source: Upload files
pt: Fazer upload de arquivos
ru: Загрузка файлов

# FileManager_AddFolder
source: New folder
pt: Nova pasta
ru: Новая папка

# FileManager_AddFolder_Cancel
source: Cancel new folder
pt: Cancelar nova pasta
ru: Отменить новую папку

# FileManager_Delete_File
source: Delete File
pt: Excluir arquivo
ru: Удалить файл

# FileManager_Select
source: Select
pt: Selecionar
ru: Выбирать

# FileManager_Delete_Folder
source: Delete Folder
pt: Excluir pasta
ru: Удалить папку

# FileManager_Delete_Confirm
source: Are you sure you want to delete {0}?
pt: Tem certeza de que deseja excluir {0}?
ru: Вы уверены, что хотите удалить {0}?

# FileManager_Delete_Success
source: {0} was sucessfully deleted.
pt: {0} foi apagado com sucesso.
ru: {0} успешно удалены.

# FileManager_Delete_Error
source: An error occurred deleting {0}
pt: Ocorreu um erro ao excluir {0}
ru: Произошла ошибка удаления {0}

# FileManager_Error_DirectoryListing
source: An error occurred getting the directory listing:
pt: Ocorreu um erro ao obter a listagem de diretórios:
ru: Произошла ошибка получения каталога:

# FileManager_Error_DeleteFolder
source: An error occurred deleting the folder:
pt: Ocorreu um erro ao excluir a pasta:
ru: Произошла ошибка удаления папки:

# FileManager_Error_DeleteFile
source: An error occurred deleting the file:
pt: Ocorreu um erro ao excluir o arquivo:
ru: Произошла ошибка удаления файла:

# FileManager_Error_CreateFolder
source: An error occurred creating the folder:
pt: Ocorreu um erro ao criar a pasta:
ru: Произошла ошибка создания папки:

# FileManager_UploadingProgress
source: Uploading...
pt: Enviando...
ru: Загрузка ...

# FileManager_Help
source: Drag files onto the box below to upload. Double click to navigate folders.
pt: Arraste arquivos na caixa abaixo para fazer o upload. Dê um duplo clique para navegar por pastas
ru: Перетащите файлы сюда, чтобы загрузить. Дважды щелкните, для навигации по папкам

# FileManager_Extension_Not_Supported
source: Only files with the extension {0} can be uploaded.
pt: Somente arquivos com a extensão {0} pode ser enviado.
ru: Только файлы с расширением {0} могут быть загружены.

# SiteSettings_Configuration_HeadContent
source: Additional head tag content
pt: Conteúdo adicional para a tag {head}
ru: Дополнительный контент тега head

# SiteSettings_Configuration_FileManager
source: File manager
pt: Gerenciador de arquivos
ru: Файловый менеджер

# SiteSettings_Configuration_HeadContent_Help
source: Any additional HTML or scripts you enter here will be added to the {head} tag of the page.
pt: Qualquer HTML ou script adicional que você inserir aqui será adicionado à tag {head} da página.
ru: Любые дополнительные скрипты или HTML введенные здесь,будут добавлены в области {head} страницы.

# SiteSettings_Configuration_NavMenu
source: Navigation menu markup
pt: Menu de navegação
ru: Разметка левого меню

# SiteSettings_Configuration_NavMenu_Help
source: The navigation menu, which is typically on the left hand side but varies according to the theme. Markup is accepted and should be done in the markdown format your wiki uses. You can also use the following tokens which are replaced with links (some of which may be empty if you are not logged in): {MENUTOKENS}
pt: O menu de navegação, normalmente é no lado esquerdo mas varia de acordo com o tema. Markup é permitido e deve ser feito no formato de marcação que o seu wiki usa. Você também pode usar os seguintes tokens que são substituídos por links (alguns destes podem estar vazios caso você não esteja logado): {MENUTOKENS}
ru: Навигации по меню, которое обычно располагается на левой стороне, и изменяется в соответствии с темой. Разметка должна быть сделана в текущем формате вики-разметки. Вы также можете использовать следующие маркеры которые заменяются ссылками (некоторые из которых могут быть пусты, если вы не вошли в систему): {MENUTOKENS}

# SiteSettings_Configuration_FileManager_OverwriteExisting
source: Automatically overwrite existing files on upload
pt: Substituir os arquivos existentes automaticamente no upload
ru: Автоматическая перезапись существующих файлов при загрузке

# SiteSettings_Configuration_FileManager_OverwriteExisting_Help
source: Check this if you want file names that already exist in the attachments folder to be automatically overwritten.
pt: Marque esta opção se você quiser os nomes dos arquivos que já existem nos anexos pasta a ser automaticamente substituído.
ru: Проверьте это, если вы хотите имена файлов, которые уже существуют в папке вложения, которые будут автоматически перезаписаны.

# SiteSettings_Plugins_Title
source: Plugins
ru: Плагины

# SiteSettings_Tools_SqlExport
source: Export as SQL
pt: Exportar como SQL
ru: Экспорт в SQL

# SiteSettings_Tools_SqlExport_Label
source: Exports the current database as a single SQL script. If you are using MongoDB this action does nothing.
pt: Exporta o atual banco de dados como um único script SQL. Se você estiver usando MongoDB esta ação não faz nada.
ru: Экспортирует текущую базу данных в отдельный SQL сценарий. Если вы используете MongoDB это действие ничего не делает.

# SiteSettings_Configuration_IsPublicSite
source: Public site
pt: Site público
ru: Открытый сайт

# SiteSettings_Configuration_IsPublicSite_Help
source: When un-checked, all pages are private and can only be viewed by logged in users.
pt: Quando desmarcada, todas as páginas são privadas e só podem ser vistos por usuários logados.
ru: Когда снята галочка, все страницы являются закрытыми, и их можно посетить только зарегистрированным пользователям.

# SiteSettings_Configuration_IgnoreSearchIndexErrors
source: Ignore search index errors
pt: Ignorar erros de índice de pesquisa
ru: Игнорировать ошибки поискового индекса

# SiteSettings_Configuration_IgnoreSearchIndexErrors_Help
source: When checked, an error is displayed when a page fails to be indexed by the Lucene search engine (when creating or updating a page), instead of being ignored.
pt: Quando selecionado, um erro é exibido quando uma página não foi indexada pelo motor de busca Lucene (ao criar ou atualizar uma página), em vez de ser ignorada.
ru: Если флажок установлен, выводится сообщение об ошибке, когда страница не была проиндексирована поисковым движком Lucene (при создании или обновлении страницы), иначе ошибка будет проигнорировать.

# FileManager_Upload_FileAlreadyExists
source: The file '{0}' already exists.
pt: O arquivo '{0}' já existe.
ru: Файл '{0}' уже существует.

# History_Help_Label
source: Click on a version number to compare the changes with version before it.
pt: Clique em um número de versão para comparar as mudanças com a versão anterior.
ru: Нажмите на номер версии, чтобы сравнить изменения с предыдущей версией.

# SiteSettings_Configuration_Required_Field
source: This field is required.
pt: Este campo é obrigatório.
ru: Это поле обязательно.

# Button_Test
source: Test
pt: Testar
ru: Тест

# Shared_Success
source: Success!
pt: Sucesso!
ru: Успех!

# Shared_Failure
source: Failure!
pt: Falha!
ru: Несоблюдение!

# DatabaseConnection_Success
source: The database connection was successful.
pt: A conexão com o banco foi bem sucedida.
ru: Соединение с базой данных была успешной.

# DatabaseConnection_Failure
source: Database connection failed:
pt: Conexão do banco de dados falhou:
ru: Подключение к базе данных не удалось:

# Button_Add
source: Add
pt: Adicionar
ru: Добавлять

# Attachments_Folder_Success
source: Success! The directory exists and can be written to.
pt: Sucesso! O diretório existe e pode ser gravado.
ru: Успех! Каталог существует и может быть записан на.

# Attachments_Folder_Failure
source: Unable to write to the attachments directory:
pt: Não foi possível escrever no diretório de anexos:
ru: Невозможно записать в каталог вложений:

# Shared_Unexpected_Error
source: Something went wrong
pt: Algo deu errado
ru: Что-то пошло не так

# Profile_Not_Available
source: Windows authentication is enabled, so the user profile is not available.
pt: A autenticação do Windows está ativada, portanto o perfil de usuário não está disponível.
ru: Проверка подлинности Windows включена, так что профиль пользователя не доступна.

# Profile_Password_Change_Successful
source: The password was successfully changed
pt: A senha foi alterada com sucesso
ru: Пароль был успешно изменен

# Profile_Details_Updated_Successfully
source: The profile details were successfully updated.
pt: Os detalhes do perfil foram atualizados com sucesso.
ru: Детали профильные были успешно обновлены.

# Profile_Leave_Password_Blank
source: Leave the password fields blank if you do not want to change your password.
pt: Deixe os campos de senha em branco se você não quiser mudar a sua senha.
ru: Оставьте поле пароля пустым, если вы не хотите, чтобы изменить пароль.

# SiteSettings_Cache_Clear_Successful
source: All caches were successfully cleared.
pt: Todos os caches foram excluídos com sucesso.
ru: Все склады были успешно удалены.
